Revit 2027 API
BuiltInFailures.ElectricalFailures.NotEnoughRoomForParallelPipes Property
 Due to changes in elevation, there is not enough room to generate all of the parallel pipes. As a result, some pipe segments have not been generated.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NotEnoughRoomForParallelPipes { get; }
Public Shared ReadOnly Property NotEnoughRoomForParallelPipes As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NotEnoughRoomForParallelPipes {
	FailureDefinitionId^ get ();
}
static member NotEnoughRoomForParallelPipes : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ElectricalFailures Class
Autodesk.Revit.DB Namespace